[
  {
    "url": "https://facebook.com/sharer/sharer.php?u=https%3A%2F%2Fwww.rappler.com%2Fnewsbreak%2Ffact-check%2Fviral-video-promotes-anti-diabetes-foot-patch-fake%2F&utm_source=fb_share&utm_medium=social",
    "title": "No Title",
    "content": ""
  },
  {
    "url": "https://facebook.com/sharer/sharer.php?u=https%3A%2F%2Fwww.rappler.com%2Fnewsbreak%2Ffact-check%2Fno-six-tropical-cyclones-entering-philippines-july-23-2025%2F&utm_source=fb_share&utm_medium=social",
    "title": "No Title",
    "content": ""
  },
  {
    "url": "https://facebook.com/sharer/sharer.php?u=https%3A%2F%2Fwww.rappler.com%2Fnewsbreak%2Ffact-check%2Fskin-bones-photo-rodrigo-duterte-facebook-reel-ai-generated%2F&utm_source=fb_share&utm_medium=social",
    "title": "No Title",
    "content": ""
  },
  {
    "url": "https://www.rappler.com/newsbreak/fact-check/video-flood-quezon-avenue-underpass-ai-generated/",
    "title": "FACT CHECK: Video of flooded Quezon Avenue underpass is AI-generated",
    "content": "Claim:A video shows floodwaters sweeping up numerous vehicles out of the Quezon Avenue underpass due toTropical Storm Crising (Wipha).\nWhy we fact-checked this:A Facebook user posted the clip on July 19, which has over 4.8 million views, 8,300 reactions, 3,300 comments, and 1,900 shares as of writing. It has since been deleted, but other Facebook users have reposted the same clip, with captions claiming the image shows a flooded Quezon Avenue underpass.\nThe video made the rounds online as Severe Tropical Storm Crising brought heavy rain to Northern Luzon, later exiting the Philippine Area of Responsibility (PAR) on July 19.\nThe facts:The video is AI-generated. The original video came from a YouTube channel called Disaster Strucks, which produces disaster-related AI videos and says in its description, “The videos you see is just pure art, made entirely by me.”\nThe account posted the original video on July 8 and reposted it on theirTikTok accounton July 9, where it got over 664,000 views.\nWhile the original video did not claim to show scenes from the Philippines, the Facebook users who reposted it added the text overlays to falsely claim that it shows a flooded Quezon Avenue underpass. Furthermore, the images shown in the cliplook differentfrom the Quezon Avenue underpass.\nIn a message to Rappler on July 25, the Quezon City Public Affairs and Information Services Department stated that no severe flooding was observed along the underpass on July 19, contrary to what was depicted in the clip.\nState of calamity:On July 22, the Quezon City governmentdeclared a state of calamityto mobilize its manpower and resources to critical areas affected by Crising and the southwest monsoon (habagat).\nIn a press release, Mayor Joy Belmonte stated, “With access to the Quick Response Fund, our barangay officials now have both the authority and capacity to respond swiftly to the urgent needs of their constituents, especially those displaced or at risk.”\nOver 38,000 individuals across 63 barangays were affected by the flooding as of July 22.\nRappler has recently debunked similar flood and disaster-related claims that have been circulating online.\n– Eirene Manatlao/Rappler.com\nEirene Manatlao is a senior journalism student at the Polytechnic University of the Philippines. AnAries Rufo Journalism Fellowof Rappler for 2025, she is also the associate feature editor ofThe Catalyst.\nKeep us aware of suspicious Facebook pages, groups, accounts, websites, articles, or photos in your network by contacting us at factcheck@rappler.com. You may also report dubious claims to the#FactsFirstPH tiplineby messagingRappler on FacebookorNewsbreak via Twitter direct message. Let us battle disinformation oneFact Checkat a time."
  },
  {
    "url": "https://www.rappler.com/newsbreak/fact-check/skin-bones-photo-rodrigo-duterte-facebook-reel-ai-generated/",
    "title": "FACT CHECK: ‘Skin and bones’ photo of Duterte used in Facebook reel is AI-generated",
    "content": "Claim:Former president Rodrigo Duterte, who is currently detained at the International Criminal Court (ICC), looks visibly thin and frail as seen in a photo.\nWhy we fact-checked this:The Facebook reel has already received 4.9 million views, 90,900 reactions, 18,800 comments, and 11,000 shares as of writing. It was posted amid reports that the former president hadlost a lot of weightwhile at the ICC detention facility in The Hague, Netherlands.\nThe reel used a photo of Duterte sitting on his bed, appearing physically weak. Text on the video says, “Buto’t balat na lang. Tatay Digong, ang sakit.”\n(Just skin and bones. It hurts, Tatay Digong).\nThe facts:The photo is AI-generated. AI image detectorSight Engineflagged the photo as 98% likely to be AI-generated, while results fromHive Moderationshow that the photo is 88.1% likely to contain AI-generated content.Decopy AI, meanwhile, flagged the image as 97.80% likely to be AI-generated.\nThe account that posted the Facebook reel did not put a disclaimer that the photo was generated using AI tools, misleading viewers.\nFollowing a recent visit to her father, Vice President Sara Duterte recentlydebunkedphotos portraying a “skin and bones” image of her father lying on a hospital bed.\n“It’s not true that that’s his photo. That photo is not true; that photo was probably edited. That’s a different patient; they just changed the face of former president Duterte,” the Vice President said in an interview with reporters at The Hague.\nWhile the Vice President said her father had lost weight, she said he was not bedridden. “Earlier, he was walking alone. He was carrying a cane. So, clearly, he wasn’t sick,” she added.\nMindaNews has alsofact-checkeda similar AI-generated “skin and bones” photo of the former president.\n‘Skin and bones’:On July 4, Duterte’s ex-wife, Elizabeth Zimmerman, said in aninterviewwith supporters in The Hague that the former president is now “skin and bones,” but stressed that he looked healthy otherwise. Zimmerman explained that her former husband lost weight because he does not like the food being served to him at the ICC detention facility.\nSara Duterte alsosaid the samewhen asked about her father’s condition.\n“Yes, PRRD… I’ll expound on what skin and bones mean — he’s skinny. He’s so skinny that you’ve never seen him this skinny. I think I saw him this skinny when he was young and in a photo when he was young. His arm is only half the size of mine, so he’s that skinny,” she said in Filipino.\nMalacañang, meanwhile, is not worried over reports of Duterte being “skin and bones,” noting that the former president had been described as “okay” despite the weight loss.\nICC arrest:Duterte has been detained at the ICC since he wasarrestedon March 11 over charges of crimes against humanity linked to his war on drugs. He is currently awaiting the confirmation of charges hearing scheduled on September 23, 2025.– Angelee Kaye Abelinde/Rappler.com\nAngelee Kaye Abelinde is a student journalist based in Naga City, and an alumna of Rappler’sAries Rufo Journalism Fellowship 2024.\nKeep us aware of suspicious Facebook pages, groups, accounts, websites, articles, or photos in your network by contacting us at factcheck@rappler.com. Let us battle disinformation one Fact Check at a time."
  },
  {
    "url": "https://facebook.com/sharer/sharer.php?u=https%3A%2F%2Fwww.rappler.com%2Fnewsbreak%2Ffact-check%2Fsupreme-court-ruling-impeachment-did-not-declare-sara-duterte-innocent%2F&utm_source=fb_share&utm_medium=social",
    "title": "No Title",
    "content": ""
  },
  {
    "url": "https://facebook.com/sharer/sharer.php?u=https%3A%2F%2Fwww.rappler.com%2Fnewsbreak%2Ffact-check%2Fno-lawsuit-filed-vs-bato-dela-rosa-missing-sabungero-case%2F&utm_source=fb_share&utm_medium=social",
    "title": "No Title",
    "content": ""
  },
  {
    "url": "https://www.rappler.com/newsbreak/fact-check/post-falsely-claims-detained-suspects-paolo-tantoco-death-shown-website/",
    "title": "FACT CHECK: Post falsely claims detained suspects in Tantoco death shown on website",
    "content": "Claim:Results from the “inmate lookup” function on the Beverly Hills Jail Inmate Roster show that several people were detained in Beverly Hills, Los Angeles, California, in connection with the death of Rustan executive Paolo Tantoco on March 9.\nWhy we fact-checked this:The claim can be found in a July 14 Facebook post on the account of former broadcaster Jay Sonza.\nThe post shows screenshots of search results from a website named “Beverly Hills Jail Inmate Roster Lookup,” with the URLhttps://beverlyhillsjailroster.org/. The screenshots show a search for First Lady Louise Marcos or Liza Araneta-Marcos, Cebu 5th District Representative Duke Frasco, tourism secretary Christina Frasco, and Limuel Borgonia. Text on the screenshots indicates that reports were available for the said individuals, implying that they have been detained in Beverly Hills Jail.\nThe post was made amid claims of the First Lady’s alleged links toTantoco’s death. As of writing, the post already has around 1,400 reactions, 144 comments, and 186 shares.\nThe facts:The method used by Sonza to show that the First Lady and others were supposedly detained in Beverly Hills Jail is unreliable.\nUsing Sonza’s approach, any name (or even a non-name) can be made to appear as if reports about them exist in the inmate roster, as shown in the examples below:\n\n\n\n\n\n\nThe website also states in itsdisclaimerthat it is not a government-affiliated website: “This website is operated by a privately owned company and is not affiliated, associated, authorized, endorsed by, or in any way officially connected with any government entity, agency, office, or the correctional facilities listed herein.”\nIt also says that it “does not guarantee the accuracy, completeness, or timeliness of the information provided on this website.”\nOn Tantoco’s death:The Rustan executivediedon March 9, and hiscause of deathwas revealed by the Los Angeles County Medical Examiner to be from “cocaine effects.”He had earlier been claimed to be part of the First Lady’s entourage for the Manila International Film Festival held from March 4 to 7. Malacañang hasclarifiedthat Tantoco was not part of the First Lady’s delegation.\nA screenshot of a supposed police report claiming that the Beverly Hills Police Department (BHPD) summoned Marcos and two others in relation to Tantoco’s death has recently circulated on social media. On July 15, Palace press officer Undersecretary Claire Castro said the supposed police report is “fake” and used by “obstructionists” to put the First Lady in a bad light. (READ:[Closer Look] Overkill and overreach in controversy linking Liza Marcos to Tantoco’s death)\n‘No one summoned’:In an email exchange with the BHPD, Lieutenant Chris Coulter of the Investigative Services Division told Rappler that the document showing the names of Marcos, Tantoco’s wife, Dinah Arroyo Tantoco, and Alexa Miro as among those who were supposedly summoned to BHPD was “NOT authentic.”\nAsked whether someone had been summoned in relation to Tantoco’s death, Coulter replied, “While we are not releasing the names of anyone interviewed, no one was ‘summoned’ to BHPD.”\nPrevious related fact-checks:Rappler has previouslyfact-checkedthe false claim that mainstream media outlets did not report Tantoco’s passing before his cause of death became known this July.\nRappler has alsofact-checked several claims from Sonza.– Percival Bueser/ Rappler.com\nPercival Bueser is a graduate of Rappler’s fact-checking mentorship program. This fact check was reviewed by a member of Rappler’s research team and a senior editor. Learn more about Rappler’s fact-checking mentorship programhere.\nKeep us aware of suspicious Facebook pages, groups, accounts, websites, articles, or photos in your network by contacting us at factcheck@rappler.com. Let us battle disinformation one Fact Check at a time."
  },
  {
    "url": "https://facebook.com/sharer/sharer.php?u=https%3A%2F%2Fwww.rappler.com%2Fnewsbreak%2Ffact-check%2Fdeepfake-sara-duterte-fake-investment-ad%2F&utm_source=fb_share&utm_medium=social",
    "title": "No Title",
    "content": ""
  },
  {
    "url": "https://www.rappler.com/newsbreak/fact-check/media-reports-death-rustan-executive-paolo-tantoco/",
    "title": "FACT CHECK: Contrary to claim, media reported on death of Rustan executive Paolo Tantoco",
    "content": "Claim:Mainstream media has only recently reported on the death of Rustan Commercial Corporation executive Paolo Tantoco — four months after his passing — following the release of the Los Angeles (LA) County Medical Examiner’s report showing the cause of death as “cocaine effects.”\nWhy we fact-checked this:The claim can be found in a July 13 post on the Facebook account “Lorraine Baddie” of former National Task Force to End Local Communist Armed Conflict official Lorraine Badoy-Partosa, who was also former Presidential Communications Operations Office undersecretary under the Rodrigo Duterte administration.\nThe post states: “Hina ng MSM[mainstream media]. Ngayon lang magre report about the Tantoco death — bitin pa. Walang mention ni Liza Marcos. Samantalang ang bloggers March pa lang complete report na.”\n(Mainstream media is weak. They have only just now reported about the Tantoco death — and the reports are incomplete. No mention of [First Lady] Liza Marcos. Meanwhile, the bloggers already have a complete report as early as March.)\nAs of writing, the post already has around 2,600 reactions, 130 comments, and 111 shares.\nThe facts:Contrary to Badoy-Partosa’s claim, mainstream media outlets have reported earlier on the death of the Rustan executive, whodiedon March 9 at the age of 44.\nExamples of these news items include aMarch 9 Manila Bulletin article, aMarch 10 Philstar.com article, aMarch 10 GMA News Online article, aMarch 10 Manila Times article, aMarch 11 Rappler article, aMarch 11 ABS-CBN News article, and aMarch 12 Daily Tribune article.\nNo cause of death was mentioned in those earlier reports.\nCause of death:In July, four months after Tantoco’s death, the LA County Medical Examiner confirmed that Tantoco died from cocaine use.\nThecase detail pagenoted that Tantoco’s death was accidental, with the primary cause being “cocaine effects.”\nThe LA medical examiner also noted “probable atherosclerotic cardiovascular disease,” or plaque buildup in the arteries, as a significant condition.\nIn the news reports citing the LA medical examiner’s report published this July, several mentioned Tantoco as part of an entourage led by Liza Araneta-Marcos. TheRappler articlepublished on July 13 at 10:51 AM (after Badoy-Partosa’s post came out), for instance, said: “According toHollywood LA News, Tantoco was in the US as part of First Lady Liza Araneta-Marcos’ entourage at the Manila International Film Festival, which was held from March 4 to 7.”\nAnother one that did likewise is aJuly 13 Manila Standard articlewhich came out at 8:56 PM.\nPrevious related fact-checks:Rappler has published fact-checks of claims pertaining to Tantoco’s death:\nMalacañang has previouslydeniedclaims of the First Lady’s alleged connection with Tantoco’s death, which surfaced online following former president Rodrigo Duterte’sarrestover a warrant issued by the International Criminal Court. –Percival Bueser/ Rappler.com\nPercival Bueser is a graduate of Rappler’s fact-checking mentorship program. This fact check was reviewed by a member of Rappler’s research team and a senior editor. Learn more about Rappler’s fact-checking mentorship programhere.\nKeep us aware of suspicious Facebook pages, groups, accounts, websites, articles, or photos in your network by contacting us at factcheck@rappler.com. Let us battle disinformation one Fact Check at a time."
  },
  {
    "url": "https://www.rappler.com/newsbreak/fact-check/no-six-tropical-cyclones-entering-philippines-july-23-2025/",
    "title": "FACT CHECK: No 6 tropical cyclones entering PH on July 23, 2025",
    "content": "Claim: Classes are reportedly suspended on Wednesday, July 23, due to the alleged simultaneous entry of six tropical cyclones that would affect the Philippines.\nWhy we fact-checked this: A Facebook page named “Walang Pasok Updates”falsely claimed that classes on July 23 are suspended due to the alleged simultaneous entry of six tropical cyclones into the country. As of writing, the post containing the claim has garnered nearly 12,000 shares and around 1,500 reactions on Facebook.\nThe graphic accompanying the post contains a fake weather advisory designed to mimic an official Philippine Atmospheric, Geophysical, and Astronomical Services Administration (PAGASA) update.\nThe post reads:“Announcement: Walang Pasok. Inaasahang 6 pa na bagyo ang papasok sa pilipinas sa araw ng Huwebes ng sabay sabay July 23 2025 at 6:00am.”\nIt adds:“6 BAGYO SA HUWEBES. Pangalan ng mga Bagyo, Dante, Emong, Fabian, Gorio, Huaning at Isang.”\nThe facts:In aFacebook post on Tuesday, July 22, PAGASA debunked the claim, calling the post fake.\n“Hindi totoo ang kumakalat na impormasyon na may anim na bagyo na papasok sa Pilipinas ngayong linggo. Maling impormasyon din ang suspensyon ng klase na iniuugnay dito,”the weather bureau said in the post.\n(The circulating information that six tropical cyclones will enter the Philippines this week is not true. The class suspension being linked to this is also false information.)\nOnly one tropical cyclone:Of the two low pressure areas (LPAs) being monitored inside the Philippine Area of Responsibility (PAR), only one has developed into a tropical cyclone as of Tuesday — Tropical Depression Dante. Dante is the country’s fourth tropical cyclone for 2025, and the third for July.\nThe other LPA inside PAR currently has a “medium” chance of developing into a tropical cyclone within 24 hours. But another scenario also shows it may merge with the bigger circulation of Dante, according to PAGASA.\nFor weather updates:For legitimate weather updates, visit PAGASA’sofficial website,X (formerly Twitter) page, andYouTube channel. Updates can also be found on Rappler’sPhilippine weather page.– Princess Leah Sagaad/Rappler.com\nPrincess Leah Sagaad completed her undergraduate degree in development communication at the University of the Philippines Los Baños. An Aries Rufo Journalism Fellow of Rappler for 2025, she is also the former associate managing editor for short form reporting ofTanglaw.\nKeep us aware of suspicious Facebook pages, groups, accounts, websites, articles, or photos in your network by contacting us at factcheck@rappler.com. Let us battle disinformation one Fact Check at a time."
  },
  {
    "url": "https://facebook.com/sharer/sharer.php?u=https%3A%2F%2Fwww.rappler.com%2Fnewsbreak%2Ffact-check%2Fmartin-romualdez-no-death-sentence-2025-national-budget%2F&utm_source=fb_share&utm_medium=social",
    "title": "No Title",
    "content": ""
  },
  {
    "url": "https://www.rappler.com/newsbreak/fact-check/supreme-court-ruling-impeachment-did-not-declare-sara-duterte-innocent/",
    "title": "FACT CHECK: SC ruling on impeachment did not declare Sara Duterte innocent",
    "content": "Claim:In ruling that the impeachment ofVice President Sara Duterteis unconstitutional, the Supreme Court (SC) declared Duterte innocent of the charges against her.\nWhy we fact-checked this:The Facebook post containing the claim has 2,300 likes, 300 shares, and 256 comments as of writing. It was later reposted on TikTok, where it has reached 219,500 views, 14,600 likes, 417 shares, and 485 comments.\nThe post shows a quote card featuring SC Senior Associate Justice Marvic Leonen, who penned the unanimous ruling. The quote on the card states: “It is not our duty to favor any political result. Ours is to ensure that politics are framed within the Rule of Just Law.” Text overlaid on the quote card reads: “Duterte [is] innocent.”\nThe post was made after the SCissued a ruling on July 25barring the impeachment proceedings against Duterte, who is accused of betrayal of public trust, culpable violation of the Constitution, bribery, graft and corruption, and other high crimes.\nThe facts:TheSupreme Court rulingdid not declare Duterte innocent of the charges against her. No credible news outlets, official Supreme Court records, or transcripts contain any statement from Leonen or the High Court declaring the Vice President “innocent.”\nThe circulating post uses a quote card featuring Leonen’s photo and a line from the SC decision. However, the added text “Duterte [is] innocent” does not appear in the ruling and seems to have been inserted to mislead viewers.\nSupreme Court spokesperson Camille Ting stressed in a press briefing that the decision “is not absolving Vice President Duterte from any of the charges against her,” as the impeachment complaints may still be refiled next year.\n‘Unconstitutional’:The High Court halted theimpeachment proceedingsagainst Duterte on procedural grounds. It cited the 1987 Constitution’s one-year bar rule, which prohibits more than one impeachment case against the same official within a period of one year.\n“The SC has ruled that the House impeachment complaint versus VP Sara Duterte is barred by the one-year rule and that due process or fairness applies in all stages of the impeachment process,” Ting said in the briefing. (READ:DOCUMENT: Supreme Court decision barring Sara Duterte impeachment)\nFour impeachment complaintswere filed against Duterte at the House of Representatives. The SC stated that, as the House did not act on the first three complaints lodged by civic groups in December 2024, these were considered “terminated” on February 5, 2025.\nThe fourth complaint, a February 2025 resolution backed by more than two-thirds of the House, was ruled to fall within the same one‑year period. Consequently, the High Court said that no new impeachment complaint may be filed until February 6, 2026. (READ:Sara impeachment: What are implications of SC’s new ruling?)\nMotion for reconsideration:TheHouse of Representativesis now preparing to contest the SC ruling, withSpokesperson Princess Abantecalling it a “factual and procedural inversion.”\nAbante disputed the High Court’s claim that the Articles of Impeachment were sent to the Senate without approval, pointing to plenary records showing the February complaint was verified, signed by over one‑third of members, and transmitted alongside a vote to archive the earlier complaints.\nAbantesaidthat the House will file a Motion for Reconsideration, in hopes that “once the facts are corrected, the Court will arrive at a different and more just conclusion.”– Marjuice Destinado/Rappler.com\nMarjuice Destinado is a senior political science student at Cebu Normal University (CNU). AnAries Rufo Journalism Fellowof Rappler for 2025, she is also the feature editor ofAng Suga, CNU’s official student publication."
  },
  {
    "url": "https://facebook.com/sharer/sharer.php?u=https%3A%2F%2Fwww.rappler.com%2Fnewsbreak%2Ffact-check%2Fvideo-flood-quezon-avenue-underpass-ai-generated%2F&utm_source=fb_share&utm_medium=social",
    "title": "No Title",
    "content": ""
  },
  {
    "url": "https://www.rappler.com/newsbreak/fact-check/martin-romualdez-no-death-sentence-2025-national-budget/",
    "title": "FACT CHECK: Romualdez not sentenced to death over 2025 budget mess",
    "content": "Claim:Leyte 1st District RepresentativeMartin Romualdezwill be sentenced to death by hanging for his alleged role in irregularities in the 2025 national budget.\nWhy we fact-checked this:The TikTok video containing the claim has 429,900 views, 15,500 likes, 1,450 shares, and 716 comments as of writing.\nText in the video states:“Bitay ang hatol sa kaso ni Romualdez Marcos. Lagot mga Marcos. Senators at Marcos supporters, magtago na kayo sa lungga niyo. Ganti ng Team Duterte.”\n(Romualdez Marcos has been sentenced to death by hanging. The Marcos family is doomed. Senators and Marcos supporters, go hide — this is Team Duterte’s revenge.)\nThe video also shows a screenshot of a GMA News report with the text“Dahil sa 2025 nat’l budget(because of the 2025 national budget)”.\nThe facts:No Philippine court has sentenced Romualdez to death by hanging over alleged irregularities in the 2025 national budget. The post merely uses a GMA News clip about amotionfiled with the Ombudsman seeking the preventive suspension of Romualdez and other House officials for allegedly falsifying legislative documents.\nMoreover, the death penalty has been abolished in the Philippines since 2006 underRepublic Act No. 9346, and no law has reinstated it, making such a sentence legally unlikely.\nBudget irregularities:Romualdez and other House leaders facegraft and falsification complaintsfiled before the Office of the Ombudsman on February 10, 2025. The petitioners claimed P241 billion was unlawfully inserted into the 2025 national budget by filling in 12 blank line items before theGeneral Appropriations Actwas signed. (READ:2025 budget ‘blanks’: Billions involved in DA adjustments after ratification)\nThe petitioners also sought the preventive suspension of Romualdez and three other lawmakers to prevent possible evidence tampering or witness influence. (READ:[In This Economy] Who filled in the blanks in the 2025 budget?)\nHowever, in arulingdated March 7 but released on March 11, Ombudsman Samuel Martires denied the plea to suspend Romualdez, stressing that his office has no authority to suspend members of Congress.\nThe Ombudsman also held the criminal complaints in abeyance pending the Supreme Court’s decision on a petitionquestioning the constitutionality of the 2025 budget.– Marjuice Destinado/Rappler.com\nMarjuice Destinado is a senior political science student at Cebu Normal University (CNU). AnAries Rufo Journalism Fellowof Rappler for 2025, she is also the feature editor ofAng Suga, CNU’s official student publication.\nKeep us aware of suspicious Facebook pages, groups, accounts, websites, articles, or photos in your network by contacting us at factcheck@rappler.com. Let us battle disinformation one Fact Check at a time."
  },
  {
    "url": "https://facebook.com/sharer/sharer.php?u=https%3A%2F%2Fwww.rappler.com%2Fnewsbreak%2Ffact-check%2Fphoto-rodrigo-duterte-wheelchair-fake%2F&utm_source=fb_share&utm_medium=social",
    "title": "No Title",
    "content": ""
  },
  {
    "url": "https://facebook.com/sharer/sharer.php?u=https%3A%2F%2Fwww.rappler.com%2Fnewsbreak%2Ffact-check%2Fphoto-bedridden-rodrigo-duterte-fake-digitally-altered%2F&utm_source=fb_share&utm_medium=social",
    "title": "No Title",
    "content": ""
  },
  {
    "url": "https://facebook.com/sharer/sharer.php?u=https%3A%2F%2Fwww.rappler.com%2Fnewsbreak%2Ffact-check%2Frodrigo-duterte-not-back-in-philippines-family-photo-misused%2F&utm_source=fb_share&utm_medium=social",
    "title": "No Title",
    "content": ""
  },
  {
    "url": "https://facebook.com/sharer/sharer.php?u=https%3A%2F%2Fwww.rappler.com%2Fnewsbreak%2Ffact-check%2Fdeepfake-videos-bam-aquino-journalists-used-investment-plan-ad%2F&utm_source=fb_share&utm_medium=social",
    "title": "No Title",
    "content": ""
  },
  {
    "url": "https://www.rappler.com/newsbreak/fact-check/",
    "title": "Fact Check",
    "content": ""
  },
  {
    "url": "https://facebook.com/sharer/sharer.php?u=https%3A%2F%2Fwww.rappler.com%2Fnewsbreak%2Ffact-check%2Fpost-falsely-claims-detained-suspects-paolo-tantoco-death-shown-website%2F&utm_source=fb_share&utm_medium=social",
    "title": "No Title",
    "content": ""
  },
  {
    "url": "https://facebook.com/sharer/sharer.php?u=https%3A%2F%2Fwww.rappler.com%2Fnewsbreak%2Ffact-check%2Fvideo-shows-strong-winds-vietnam-not-tropical-storm-dante-impact%2F&utm_source=fb_share&utm_medium=social",
    "title": "No Title",
    "content": ""
  },
  {
    "url": "https://www.rappler.com/newsbreak/fact-check/rodrigo-duterte-not-back-in-philippines-family-photo-misused/",
    "title": "FACT CHECK: Duterte not back in PH, family photo misused",
    "content": "Claim:Former president Rodrigo Duterte is back in the Philippines with his family.\nWhy we fact-checked this:The photo, posted on July 4, has already received 28,000 reactions, 2,300 comments, and 257 shares as of writing. Its caption says, “Welcome back.”\nThe photo and the post’s caption imply that the International Criminal Court (ICC) has released Duterte from his detention in The Hague, Netherlands.\nThe facts:Duterte is not back in the Philippines. Since hisarrestlast March, he has remained under ICC custody for crimes against humanity over his war on drugs. He is currently awaiting his confirmation of charges hearing on September 23.\nFamily photo:The photo used in the post is likely real. Results from AI detection toolsSight Engine,Hive Moderation, andDecopy AIall show that the photo is not likely AI-generated.\nThe photo may have been taken when Duterteflew to Hong Kongfor thePasasalamat kay PRRD with OFWsevent on March 9, a few days before he wasarrestedat the Ninoy Aquino International Airport and later transferred to the ICC detention center in The Hague.\nDuterte’s case:On June 12, Duterte’s legal team filed arequest for interim releaseto an undisclosed country, a request stronglyopposedby ICC prosecutors.\n“The continued detention of Mr. Duterte remains necessary because the constituent conditions set out…are met. The Prosecution, therefore, strongly opposes Mr. Duterte’s interim release to [unnamed country],” said the prosecution in a filing signed by deputy prosecutor Mame Mandiaye Niang.\nThe ICC’s plenary of judges has also recentlydismissedDuterte’s request to disqualify Judges Reine Adélaïde Sophie Alapini-Gansou and María del Socorro Flores Liera from hearing his case. The plenary of judges said Alapini-Gansou and Flores Liera exhibited no bias or lack of impartiality. They were also found to have complied with their judicial duties under the Rome Statute, and the plea was deemed legally unfounded.\nOn July 8, Vice President Sara Duterte flew back to The Hague tovisither detained father. She later told reporters that her father hadlost a lot of weightwhile in detention and had already given hislast wishes.\nPrevious fact checks:Rappler has previously debunked similar false claims about Duterte being released from detention:\n– Angelee Kaye Abelinde/Rappler.com\nAngelee Kaye Abelinde is a student journalist based in Naga City, and an alumna of Rappler’sAries Rufo Journalism Fellowship 2024.\nKeep us aware of suspicious Facebook pages, groups, accounts, websites, articles, or photos in your network by contacting us at factcheck@rappler.com. Let us battle disinformation one Fact Check at a time."
  },
  {
    "url": "https://www.rappler.com/newsbreak/fact-check/mexico-flood-video-misrepresented-crising-impact-philippines/",
    "title": "FACT CHECK: Video of flood in Mexico misrepresented as impact of Crising",
    "content": "Claim:A video shows a van being swept away by a flash flood triggered by Severe Tropical Storm Crising (Wipha), which brought heavy rain to parts of Luzon in the Philippines.\nWhy we fact-checked this:The video bearing the claim has already received 3.2 million views, 21,300 reactions, 2,700 shares, and 2,100 comments as of writing. It was posted on July 19 asSevere Tropical Storm Crisingbrought heavy rain to Northern Luzon, passing close to mainland Cagayan and Babuyan Islands before exiting the Philippine Area of Responsibility (PAR).\nThe video shows a van being swept away by a flash flood, with text saying, “Crising, tama na(Crising, that’s enough),” spreading alarm among Facebook users.\nThe account that posted the video did not say when and where the clip was taken.\nThe facts:The video does not show the impact of Severe Tropical Storm Crising. The flooding shown in the video did not happen in the Philippines, but in Menchaca, Querétaro, Mexico, on June 15, 2025. At the time,Tropical Storm Dalilawas passing over Mexico, bringing heavy rains.\nSimilar videos of the flood were also posted onJune 16 and June 17,with captions stating the flood happened inMexico on June 15.\nAFP Fact Checkhas previously debunked a similar claim linking the same video to flooding in Texas. UsingGoogle Street View imagery, it identified the street captured in the footage as Calle Río Culiacán, which is located in Menchaca, Querétaro, in Mexico.\nHeavy rain in Luzon:Crisingdevelopedinto a tropical depression on July 16, becoming the Philippines’ third tropical cyclone for 2025 and the second tropical cyclone for July. Itintensifiedinto a severe tropical storm on July 19 before exiting the PAR.\nEven after its exit, Crising caused heavy rainfall and enhanced thesouthwest monsoonorhabagat. In Cagayan province, the severe tropical stormdisplacedat least 2,000 families and caused an estimated P17 million in losses to the agriculture and fisheries sector.\n\nPrevious fact checks:Rappler has previously debunked similar false claims about flooding and storms in the Philippines:\nWeather updates:As of Thursday, July 24, the Philippine Atmospheric, Geophysical and Astronomical Services Administration (PAGASA) is currently monitoring two tropical cyclones inside the PAR:Typhoon Emong(Co-may) and Tropical Storm Dante (Francisco).\nFor legitimate weather updates, visit PAGASA’sofficial website,X (formerly Twitter) page, andYouTube channel. Updates can also be found on Rappler’sPhilippine weather page.– Angelee Kaye Abelinde/Rappler.com\nAngelee Kaye Abelinde is a student journalist based in Naga City, and an alumna of Rappler’sAries Rufo Journalism Fellowship 2024.\nKeep us aware of suspicious Facebook pages, groups, accounts, websites, articles, or photos in your network by contacting us at factcheck@rappler.com. Let us battle disinformation one Fact Check at a time."
  },
  {
    "url": "https://www.rappler.com/newsbreak/fact-check/photo-rodrigo-duterte-wheelchair-fake/",
    "title": "FACT CHECK: Photo of Duterte in a wheelchair is fake",
    "content": "Claim:A photo shows detained former presidentRodrigo Dutertein a wheelchair, looking noticeably thin and frail as he holds a cup of coffee.\nWhy we fact-checked this:The TikTok video containing the claim has 2 million views, 220,000 likes, 15,200 shares, and 2,998 comments as of writing.\nCaption in the video states: “I was really shocked by Duterte because he is so thin, if this is true or I don’t know if it’s Al or what, I just saw on social media that he is really thin. Get well soon and just fight.”\nMany believed the clip to be authentic. One top comment saying“Nashock ako, grabe ang payat na pala niya”(I was shocked, he’s gotten really thin) received over 19,000 likes.\nThe comment section has since been flooded with well wishes, with several users expressing shock at Duterte’s appearance and hoping for his recovery.\nThe facts:There are no verified or official sources confirming the authenticity of the image. While Duterte is currentlydetainedat the International Criminal Court (ICC) detention center, the Court has not issued any image or video showing him in that state.\nThe only confirmed footage of Duterte related to ICC proceedings is from hisfirst appearancebefore Pre-Trial Chamber I on March 14, 2025. In thathearing, conducted via video link from the detention facility, he did not appear alarmingly thin and frail.\nDebunked:Rappler and other fact-checking bodies have previously debunked similar manipulated photos portraying Duterte asemaciatedorbedridden.\nThe photo of Duterte lying in a hospital bed was directlydebunkedby Vice President Sara Duterte following her visit to her detained father.\n“The photo isn’t real,” she said in a chance interview with reporters, asquoted byInquirer. “I saw one showing him in a hospital bed wearing a hospital bracelet. That photo is fake, and no photos have been released from inside.”\nShe added that her father is not hospitalized, but is currently being held in the regular detention wing of the ICC. “Earlier, he was walking alone. He was carrying a cane. So clearly, he wasn’t sick,” she said.\nOn July 4, Duterte’s ex-wife, Elizabeth Zimmerman, said in aninterviewwith supporters in The Hague that the former president is now “skin and bones,” a description alsoechoedby the Vice President.\nThey stressed, however, that while the former president had lost weight, he looked healthy otherwise.\n“Right now, he doesn’t look malnourished or weak. He’s just naturally slim,” the Vice Presidentsaid.\nConfirmation of charges hearing:Duterte has been detained at Scheveningen Prison in The Hague, Netherlands, since March 11, following hisarrestin the Philippines overcrimes against humanitycharges linked to hisbloody drug war. He is set to appear before the ICC on September 23 for aconfirmation of charges hearingto determine if his case will proceed to trial.– Marjuice Destinado/Rappler.com\nMarjuice Destinado is a junior political science student at Cebu Normal University (CNU). AnAries Rufo Journalism Fellowof Rappler for 2025, she is also the feature editor ofAng Suga, CNU’s official student publication.\n"
  },
  {
    "url": "https://facebook.com/sharer/sharer.php?u=https%3A%2F%2Fwww.rappler.com%2Fnewsbreak%2Ffact-check%2Fviral-photo-ariana-grande-ai-manipulated%2F&utm_source=fb_share&utm_medium=social",
    "title": "No Title",
    "content": ""
  },
  {
    "url": "https://www.rappler.com/newsbreak/fact-check/video-shows-strong-winds-vietnam-not-tropical-storm-dante-impact/",
    "title": "FACT CHECK: Video shows strong winds in Vietnam, not impact of Tropical Storm Dante",
    "content": "Claim:A video shows people running away in panic because of strong winds brought by Tropical Storm Dante (Francisco).\nWhy we fact-checked this:The video, posted on July 21, has already received 730,000 views, 5,400 reactions, 906 comments, and 795 shares as of writing.\nThe video shows a tent being blown away by strong winds, while people can be seen running away. Text on the video reads, “[Bagyo] Dante niabot na(Storm Dante is approaching).”\nFacebook users in the comment section expressed alarm at the footage. At the time of the video’s posting, two low pressure areas (LPAs) were being monitored inside the Philippine Area of Responsibility (PAR).\nThe account that posted the clip did not state when and where the video was taken.\nThe facts:The video shows strong winds in Vietnam, not the effects of Tropical Storm Dante in the Philippines.\nVietnam’s online media outlet, Vietnamnet.vn, reported onJuly 21, 2025, that the incident happened at a party in Tan Thanh Dong commune in Ho Chi Minh City, Vietnam. According to the news outlet, the video shows the moment guests ran away in panic because strong winds destroyed the party venue.\nTheoriginal video on TikTokwas also posted on July 20, 2025. At the time, Dante wasstill an LPAin the PAR. It developed into atropical depressionon July 22 andintensifiedinto a tropical storm on July 23.\nWeather update:According to the5 pm bulletinissued by the Philippine Atmospheric, Geophysical and Astronomical Services Administration (PAGASA) on July 24, Tropical Storm Dante has exited the PAR.\nMeanwhile, another tropical cyclone, Typhoon Emong (Co-may), remains slow-moving over the coastal waters west of Pangasinan. According to the weather bureau, Emong is forecast to speed up and make landfall or pass very close to northwestern Pangasinan Thursday evening. The typhoon may also make landfall in La Union or Ilocos Sur late Thursday or Friday morning.\nDante and Emong are the fourth and fifth tropical cyclones to enter the PAR this year. The two cyclones followSevere Tropical Storm Crising(Wipha), which exited PAR on July 19 and madelandfall in Vietnamon July 22.\nPrevious fact checks:Rappler has previously debunked similar false claims about flooding and storms in the Philippines:\nFor legitimate weather updates, visit PAGASA’sofficial website,X (formerly Twitter) page, andYouTube channel. Updates can also be found on Rappler’sPhilippine weather page.– Angelee Kaye Abelinde/Rappler.com\nAngelee Kaye Abelinde is a student journalist based in Naga City, and an alumna of Rappler’sAries Rufo Journalism Fellowship 2024.\nKeep us aware of suspicious Facebook pages, groups, accounts, websites, articles, or photos in your network by contacting us at factcheck@rappler.com. Let us battle disinformation one Fact Check at a time."
  },
  {
    "url": "https://facebook.com/sharer/sharer.php?u=https%3A%2F%2Fwww.rappler.com%2Fnewsbreak%2Ffact-check%2Fno-death-sentence-drug-charges-liza-marcos%2F&utm_source=fb_share&utm_medium=social",
    "title": "No Title",
    "content": ""
  },
  {
    "url": "https://www.rappler.com/newsbreak/fact-check/world-leaders-no-meet-hague-rodrigo-duterte-release/",
    "title": "FACT CHECK: World leaders didn’t meet in The Hague to seek Duterte release",
    "content": "Claim:A photo shows world leaders gathered in The Hague, Netherlands, with a cardboard standee of former Philippine presidentRodrigo Duterte, to push for the latter’s release from detention at the International Criminal Court (ICC).\nWhy we fact-checked this:The TikTok video containing the claim has 201,700 views, 11,300 likes, 626 shares, and 659 comments as of writing.\nCaption in the video states:“BREAKING NEWS!! Pakikalat po dahil hindi ito ibabalita ng mga bayarang bias media. World leaders 2025 nag tipon tipon sa The Hague, Netherlands para sa meeting ng Bring Him Home at pag-usapan ang release ni ex former president Rodrigo Roa Duterte, at napagkasunduan din nila sa ICC na makakalaya na sa madaling panahon si FPRRD. Litrato ng mga world leaders kasama ang standee ni dating pangulong Duterte.”\n(BREAKING NEWS! Please share because this will not be reported by the paid biased media. In 2025, world leaders gathered in The Hague, Netherlands, for a “Bring Him Home” meeting to discuss the release of former president Rodrigo Roa Duterte, and it was allegedly agreed by the ICC that he will soon be freed. The photo shows world leaders with a standee of former president Duterte.)\nWhile some questioned the authenticity of the photo, many Filipinos in the comments seemed convinced. One of the most liked comments read,“Buti pa si Tatay Digs, sinali pa siya kahit tapos na termino niya. Sinasali pa siya sa ibang bansa, mahal talaga siya sa ibang bansa.”\n(Good for Father Digong, even after his term has ended, other countries still include him. He’s truly loved abroad.)\nThe facts:There are no credible reports that world leaders met in The Hague to call for Duterte’s release, nor has the ICC agreed to free him. The former president remains in ICC custody, where he has beendetainedsince March, on charges ofcrimes against humanityrelated to his administration’s bloody drug war.\n2025 NATO Summit:The photo accompanying the false claim is digitally manipulated. A reverse image search confirms that theoriginal photowas taken during a social dinner hosted by Dutch King Willem-Alexander and Queen Maxima at Huis ten Bosch Palace during the2025 North Atlantic Treaty Organization (NATO) Summitin June. The unaltered image contains no Duterte standee or “Bring Him Home” posters, contrary to the claim.\nAccording to theHague Summit Declaration, NATO leaders convened in The Hague to reinforce “the Alliance’s unity and its ironclad commitment to collective defense as enshrined in Article 5 of the Washington Treaty.” Discussions centered on strengthening deterrence and defense, addressing long-term security threats, and agreeing to invest 5% of gross domestic product annually on defense spending by 2035.\nNowhere in the summit’s declaration or agenda is Duterte mentioned, nor was his ICC case discussed.\nInterim release plea: On June 12, Duterte’s legal team requested interim release while his case is pending with the ICC. The prosecution, however, hasstrongly opposedthe request, citing risks of flight, obstruction of justice, and the possibility of further crimes.\nHisconfirmation of charges hearingremains scheduled for September 23.– Marjuice Destinado/Rappler.com\nMarjuice Destinado is a senior political science student at Cebu Normal University (CNU). AnAries Rufo Journalism Fellowof Rappler for 2025, she is also the feature editor ofAng Suga, CNU’s official student publication.\nKeep us aware of suspicious Facebook pages, groups, accounts, websites, articles, or photos in your network by contacting us at factcheck@rappler.com. Let us battle disinformation one Fact Check at a time."
  },
  {
    "url": "https://www.rappler.com/newsbreak/fact-check/bustos-dam-not-about-to-collapse/",
    "title": "FACT CHECK: Bustos Dam not about to collapse – NIA",
    "content": "Claim:The Angat Afterbay Regulator Dam in Bulacan, also known as the Bustos Dam, is on the verge of collapse.\nWhy we fact-checked this:The Facebook post making the claim has garnered 1,900 reactions, 533 shares, and 309 comments as of writing. It was posted on July 23 on the Facebook account of former broadcaster Jay Sonza, who has 351,000 followers.\n“Sa mga kababayan sa Bulacan: Kaiingat po tayo. Balita ay malapit ng bumigay ang Bustos Dam,” he wrote in a status update.\n(To the residents of Bulacan: Let’s be careful. There is news that the Bustos Dam is about to collapse.)\nReactions and comments on the post show that some Facebook users believed the claim, with one of the more popular comments blaming the situation on President Ferdinand Marcos Jr. The user wrote, “Sasabihin ni bangag sinira ng tubig. Perwisyo ang admin na ito.”\n(Bangagwill say the dam was destroyed by water. This government is a burden for us.)\n“Bangag,” which means high or intoxicated, is amoniker used by Marcos’ criticsto accuse him of alleged drug use.\nThe facts:The National Irrigation Administration (NIA) debunked Sonza’s false claim in aJuly 23 Facebook post.\n“Sa kasalukuyan, hindi pa naka-inflate o nakalobo ang rubber gates ng dam bilang bahagi ng routine maintenance na taunang isinasagawa ng NIA. Ang patuloy na pagbaba ng tubig ay dulot ng matinding pag-ulang dala ng Bagyong Crising at Habagat,” the NIA wrote in its post.\n(Currently, the dam’s rubber gates have not been inflated as part of the NIA’s routine maintenance. The continued decreasing level of water is due to the heavy rains brought by severe tropical storm Crising and the southwest monsoon.)\nThe government agency added that the dam’s structure has remained stable for the past 99 years. The NIA also advised the public not to believe fake or unverified information about the dam.\nThe NIA’s official Facebook account also commented on Sonza’s post to debunk the false claim: “Fake news po ito. Wala pong katotohanan na malapit ng bumigay ang Bustos Dam.”\n(This is fake news. There is no truth to the claim that the Bustos Dam is about to collapse.)\nBustos Dam:The false claim started circulating after the Bustos Dam begandischarging excess waterfollowing heavy rains from thesouthwest monsoon, which has been enhanced by severe tropical storm Crising.\nThis was triggered by Ipo Dam’s own release of excess water, which flowed downstream into the Bustos Dam, according to aPhilippine Star report.\nThe water releases contributed tofloodwaters rising in Bulacan. However, there are no reports about damage to the Bustos Dam or any structural instability.\nBustos Dam is a diversion dam located less than 30 kilometers from Malolos, the capital city of Bulacan. The dam is connected to the Angat River, which flows through the municipalities of Angat, Bustos, Calumpit, Hagonoy, Norzagaray, Paombong, Plaridel, Pulilan, and San Rafael, as well as the city of Baliwag in Bulacan.\nPrevious fact-checks:Rappler has debunked several false claims aboutdisasters:\n– Shay Du/Rappler.com\nKeep us aware of suspicious Facebook pages, groups, accounts, websites, articles, or photos in your network by contacting us at factcheck@rappler.com. You may also report dubious claims to the#FactsFirstPH tiplineby messagingRappler on FacebookorNewsbreak via Twitter direct message. Let us battle disinformation oneFact Checkat a time."
  },
  {
    "url": "https://www.rappler.com/newsbreak/fact-check/viral-photo-ariana-grande-ai-manipulated/",
    "title": "FACT CHECK: Viral photo of Ariana Grande is AI-manipulated",
    "content": "Claim:Singer and actress Ariana Grande is pictured during an awards ceremony, looking visibly thin with hollow cheeks.\nWhy we fact-checked this:The photo has already received 449,000 reactions, 46,900 comments, and 14,000 shares as of writing.\nThe photo of the American singer has drawn concern among social media users, who noted her extremely thin appearance and hollow cheeks.\nThe facts:While the pop star hasdrawn fans’ concernover her thinner figure, the photo used in the misleading post was manipulated using AI tools.\nResults fromthe AI image detectorSight Engineindicate thatthe image is 99% likely to be AI-generated, with a 93% likelihood of face manipulation.\nThe image was a manipulated version of theoriginal photo, which shows Grande at the 36th Annual Palm Springs International Film Awards in January 2025. This photo, showing the singer with slightly fuller cheeks, was manipulated to give her face a thinner appearance. The Facebook page did not attach any AI label to its post, misleading social media users into believing it was real.\nWeight loss:The actress’ significant weight loss has been widely discussed online since 2023. In her TikTok video released the same year, sheaddressedcomments pointing out her body, saying that there are “different ways to look healthy and beautiful.”\n“The body that you’ve been comparing my current body to was the unhealthiest version of my body,” she said, adding: “I was on a lot of antidepressants, and drinking on them, and eating poorly, and at the lowest point of my life when I looked the way you consider my healthy, but that, in fact, wasn’t my healthy.”\n“No matter what, if you think you’re saying something good or well-intentioned, whatever it is. Healthy or unhealthy, big or small, sexy not sexy, we just shouldn’t – we should really work towards not doing that as much. There are ways to compliment something or ignore something that you see that you don’t like,” sheadded.\nGrande, widely regarded as a pop icon and influential figure in music, recently starred in the filmWickedas Glinda.\nPrevious fact checks:Rappler has previously debunked similar false claims about celebrities:\n– Angelee Kaye Abelinde/Rappler.com\nAngelee Kaye Abelinde is a student journalist based in Naga City, and an alumna of Rappler’sAries Rufo Journalism Fellowship 2024.\nKeep us aware of suspicious Facebook pages, groups, accounts, websites, articles, or photos in your network by contacting us at factcheck@rappler.com. Let us battle disinformation one Fact Check at a time."
  },
  {
    "url": "https://facebook.com/sharer/sharer.php?u=https%3A%2F%2Fwww.rappler.com%2Fnewsbreak%2Ffact-check%2Fmedia-reports-death-rustan-executive-paolo-tantoco%2F&utm_source=fb_share&utm_medium=social",
    "title": "No Title",
    "content": ""
  },
  {
    "url": "https://facebook.com/sharer/sharer.php?u=https%3A%2F%2Fwww.rappler.com%2Fnewsbreak%2Ffact-check%2Fworld-leaders-no-meet-hague-rodrigo-duterte-release%2F&utm_source=fb_share&utm_medium=social",
    "title": "No Title",
    "content": ""
  },
  {
    "url": "https://facebook.com/sharer/sharer.php?u=https%3A%2F%2Fwww.rappler.com%2Fnewsbreak%2Ffact-check%2Fbustos-dam-not-about-to-collapse%2F&utm_source=fb_share&utm_medium=social",
    "title": "No Title",
    "content": ""
  },
  {
    "url": "https://www.rappler.com/newsbreak/fact-check/viral-video-promotes-anti-diabetes-foot-patch-fake/",
    "title": "FACT CHECK: Viral video promoting ‘anti-diabetes’ foot patch is fake",
    "content": "Claim:Naturopathy practitioner and medical content creator Arturo Arboleda, also known as Doc Atoie, has discovered a herbal foot patch that can cure diabetes.\nWhy we fact-checked this:The circulating video, uploaded on May 13, has already garnered over 5.4 million views, 17,000 reactions, 7,200 comments, and 1,300 shares on Facebook, effectively reaching a vast and growing number of social media users.\nAccording to the advertisement, Arboleda claimed to have found a solution to high blood sugar in the form of an herbal foot patch. This patch, the ad asserted, could replace natural insulin and diabetes medications to regulate patients’ blood sugar.\nThe foot patch supposedly contains minus ion, carapace, vitamin C, cornstarch, bamboo vinegar, tourmaline, plant powder, and wood vinegar. The video claimed that by simply sticking the patch on patients’ soles before sleeping, these components could suck out toxins affecting blood sugar levels.\nThe facts:In a message to Rappler, Arboleda’s team denied any connection to the video and information promoting the herbal anti-diabetes foot patch.\n“The video is edited and not from us,” said a message from the officialHealth Forum with Doc Atoiepage.\nThe Facebook page that posted the video, “Anti-diabetes Herbal Foot Patch,” has over 2,200 likes and 2,700 followers and consistently posts similar videos. Ads for the same product use spliced videos and fake audio of known medical practitioners and content creators to falsely imply their endorsement.\nNot a credible diabetes treatment:Contrary to the claims in the videos, there isno credible evidencethat shows herbal foot patches can replace natural insulin or prescribed medications for diabetes patients.\nThere is currentlyno cure for diabetes, although there are treatments to manage the condition. In addition to medication, which can include insulin or oral drugs,managing diabetesrequires maintaining a healthy lifestyle.\nAs of writing, there areno Food and Drug Administration-registered foot patchesin the Philippines that are proven effective in regulating blood sugar or controlling diabetes.\nHealth hoaxes:Rappler has previously fact-checked similar health-related advertisements promoting instant cures for various diseases:\nThere are various fake supplements and patches available online that use false information to lure buyers. Experts havewarned against these fake instant cures on social media. –Reinnard Balonzo/Rappler.com\nReinnard Balonzo is a journalism student based in Bicol, and an alumnus ofAries Rufo Journalism Fellow2024.\nKeep us aware of suspicious Facebook pages, groups, accounts, websites, articles, or photos in your network by contacting us at factcheck@rappler.com. Let us battle disinformation oneFact Checkat a time."
  },
  {
    "url": "https://www.rappler.com/newsbreak/fact-check/deepfake-videos-bam-aquino-journalists-used-investment-plan-ad/",
    "title": "FACT CHECK: Deepfake videos of Bam Aquino, journalists used in investment plan ad",
    "content": "Claim:Senator Bam Aquino and several ABS-CBN broadcast journalists are promoting an investment plan that claims to pay out P175,000 per week following an initial payment of P15,000.\nWhy we fact-checked this:The claim can be found in several sponsored videos on Facebook in which a likeness of Aquino can be heard promoting the supposed investment scheme. These videos also feature likenesses of ABS-CBN broadcast journalists Karmina Constantino-Torres, Bernadette Sembrano, and Karen Davila, and even display the logo of ABS-CBN’s news program,TV Patrol.\nThe videos point to external websites promoting the supposed investment program. The websites were made to look like the officialABS-CBN website, with sections like “Halalan 2025,” “Entertainment,” “News,” “Metro.Style,” “Sports,” and “More”. However, nothing happens upon clicking on these sections.\nThe facts:Aquino himself has denied promoting the supposed investment plan, which was presented in the ad as a “government-backed” initiative.\nIn aJuly 10 Senate press release, Aquino said: “Walang katotohanan ang kumakalat na AI video kung saan ini-endorso ko ang isang programa kung saan maaaring kumita nang malaki ang ating mga kababayan kapalit ng investment.”\n(The AI video circulating online, in which I was seen endorsing a program where our countrymen can earn big in exchange for investment, is not true.)\nHe said likewise in apost on his official Facebook page.\nAquino also called for investigations into the videos and called for false content to be removed from online platforms so as not to victimize others. He added that he plans to file legislation “outlawing the use of another person’s image and likeness in deepfakes intended to deceive or defraud the public.”\nSeveral news outlets have also reported on the use of deepfakes using Aquino’s likeness to promote the investment scam, such asInquirer.net,Manila Bulletin,News5,Interaksyon, andBusinessWorld Online.\nFake website:The external websites that masquerade as ABS-CBN web pages seem to be phishing sites, or sites that steal personal information by deceiving users. Their Uniform Resource Locators (URLs) are not those of the legitimateABS-CBN website. (READ:Phishing 101: How to spot and avoid phishing)\nDeepfake videos promoting the same investment scam ​​have already been circulating online as far back asFebruary 2025andApril 2025using the likeness of San Miguel Corporation chairman Ramon Ang, who has denied endorsing it.\nPrevious related fact-checks:Rappler has regularly published fact-checks of deepfake videos aided byartificial intelligence (AI)technologies.\nHere are some of Rappler’s articles discussing deepfakes and how to spot them:\n– Percival Bueser/Rappler.com\nPercival Bueser is a graduate of Rappler’s fact-checking mentorship program. This fact check was reviewed by a member of Rappler’s research team and a senior editor. Learn more about Rappler’s fact-checking mentorship programhere.\nKeep us aware of suspicious Facebook pages, groups, accounts, websites, articles, or photos in your network by contacting us at factcheck@rappler.com. Let us battle disinformation one Fact Check at a time."
  },
  {
    "url": "https://www.rappler.com/newsbreak/fact-check/no-death-sentence-drug-charges-liza-marcos/",
    "title": "FACT CHECK: No death sentence, drug charges against Liza Marcos",
    "content": "Claim:A Los Angeles court sentenced First Lady Liza Araneta-Marcos to death by hanging due to her alleged links to illegal drug operations.\nWhy we fact-checked this:A YouTube video posted on July 17 features a photo of the First Lady in its thumbnail, appearing distressed, accompanied by sensationalist text: “Deserved! Hatol kay Liza Smuggs bitay?! First Lady kinondina sa Los Angeles dahil sa pulvoron?!”\n(Deserved! Verdict on Liza the smuggler is death by hanging?! First Lady condemned in Los Angeles over drugs?!)\nThe video’s title refers to “polvoron” — a crumbly pastry — being used as a euphemism for illegal substances.\nThe video’s narration opens with the details of Marcos’ alleged conviction, further claiming that US officials had long been investigating her supposed links to international drug syndicates. The video has garnered over 4,000 views as of writing and was posted by a YouTube channel with 114,000 subscribers.\nThe facts:No court in Los Angeles or anywhere in the United States has charged, tried, or sentenced the First Lady for any crime related to illegal drugs. The video provides no evidence for its claim.\nThe false claim appears to stem from the March 9deathof Paolo “Paowee” Tantoco, an executive of Rustan Commercial Corporation and the husband of Palace Deputy Social Secretary Dina Arroyo-Tantoco, assigned to the First Lady.\nThe businessman died in a Beverly Hills hotel while in the US. He had earlier been claimed to be part of Marcos’ entourage when she flew to the US for the Manila International Film Festival (MIFF) held from March 4 to 7, 2025.\nIn July, the Los Angeles County Medical Examiner’s OfficeruledPaolo Tantoco’s death as accidental, caused by the effects of cocaine and heart disease. The official report does not mention Marcos. (READ:[Closer Look] Overkill and overreach in controversy linking Liza Marcos to Tantoco’s death)\nTampered report:Some social media users circulated what appeared to be a police report referencing the First Lady. However, Malacañang, citing the Beverly Hills Police Department, said the document wasalteredand contained inaccuracies not present in the original.\nSince March, Malacañang has repeatedly rejected any connection between the First Lady and Tantoco’s death. Press Undersecretary Claire Castro said Tantoco was not traveling as part of the First Lady’s official group and did not stay at the same hotel during the MIFF.\nRelated claims: Following Tantoco’s death, claims circulated online alleging that Marcos was detained in the US, and that thearrestof former president Rodrigo Duterte was a cover-up for this. These claims remain unsupported and have beendismissedby officials.\nRappler has published related fact-checks about Tantoco’s death:\n– Cyril Bocar/Rappler.com\nEfren Cyril Bocar is a journalist from Llorente, Eastern Samar who graduated in English Language Studies at the Visayas State University. Cyril is also a graduate of the Aries Rufo Journalism Fellowship of Rappler for 2024.\nKeep us aware of suspicious Facebook pages, groups, accounts, websites, articles, or photos in your network by contacting us at factcheck@rappler.com. Let us battle disinformation one Fact Check at a time."
  },
  {
    "url": "https://www.rappler.com/newsbreak/fact-check/photo-bedridden-rodrigo-duterte-fake-digitally-altered/",
    "title": "FACT CHECK: Photo of bedridden Duterte is fake, digitally altered",
    "content": "Claim:A photo shows former president Rodrigo Duterte looking thin and frail, wearing a hospital gown in bed.\nWhy we fact-checked this:The post has gained traction on social media with over 1,453 shares, 2,629 comments, and 13,500 reactions. Text superimposed on the photo reads: “My prayers are always with you” and “Prayer for Tatay Digong.”\nThe photo has been widely misinterpreted as depicting Duterte’s current health status, sparking concern among the former president’s supporters. Believing Duterte was in critical condition at a hospital, several social media users left messages of support and well wishes.\nThe facts:Vice President Sara Duterte said the photo of her father was edited.\nIn an interviewwith reporters at The Hague, she stated,¨Hindi po totoo ang photo na iyon. Malamang edited ang photo na iyon. Malamang ibang pasyente iyon. Inano lang nila ang mukha ni dating pangulong Duterte. Wala po siya sa ospital ng detention unit. Nandoon po siya sa regular wing ng detention unit. At kanina, naglalakad naman siya mag-isa. May dala dala siyang tungkod. So clearly wala siyang sakit na kumbaga na kailangan niyang maging bed-ridden.”\n(That photo was probably edited. It was probably a different patient. They just added the face of former president Duterte. He is not in the detention unit hospital. He is in the regular wing of the detention unit. And earlier, he was walking alone. He was carrying a cane. So clearly he is not sick enough to need to be bedridden.)\nThe Vice President made the clarification following her visit to her father, who isdetainedat the International Criminal Court (ICC) detention center over charges of crimes against humanity.\nA closer look at the image also reveals signs of digital alteration. According to aPressOne.PH fact check articleon the same photo, mismatched lighting and unnatural or distorted facial features and proportions are noticeable in the altered photo.\nRappler earlierfact-checkeda similar AI-generated “skin and bones” photo of the former president.\nDuterte’s health status:The photo circulated following an earlier statement by the Vice President, where she said her father had lost significant weight. In areport by GMA News, the Vice President described her father as “skin and bones.”\nNowhere in her statement or the GMA report was there any mention of Duterte being hospitalized or in critical condition.\nThe last update regarding the former president’s health was inMarch 2025,when he was unable to physically attend his pre-trial hearing due to health problems. Upon his arrival at the ICC detention center, however, doctors had found him to be “fully mentally aware and fit,” but agreed that he was unfit to appear in person at hispre-trial hearing.\nAccording to a GMA News report, the ICC said it isadopting “necessary measures”to ensure the health of detainees, but did not comment on the reported “skin and bones” condition of Duterte.– Naomi Cuerdo/Rappler.com\nNaomi Cuerdo is a Rappler volunteer. She is a third year student taking Applied Mathematics with a specialization in Data Science at Far Eastern University – Manila.\nKeep us aware of suspicious Facebook pages, groups, accounts, websites, articles, or photos in your network by contacting us at factcheck@rappler.com. Let us battle disinformation one Fact Check at a time."
  },
  {
    "url": "https://facebook.com/sharer/sharer.php?u=https%3A%2F%2Fwww.rappler.com%2Fnewsbreak%2Ffact-check%2Fvideo-family-swept-away-crising-flood-ai-generated%2F&utm_source=fb_share&utm_medium=social",
    "title": "No Title",
    "content": ""
  },
  {
    "url": "https://facebook.com/sharer/sharer.php?u=https%3A%2F%2Fwww.rappler.com%2Fnewsbreak%2Ffact-check%2Fmexico-flood-video-misrepresented-crising-impact-philippines%2F&utm_source=fb_share&utm_medium=social",
    "title": "No Title",
    "content": ""
  },
  {
    "url": "https://www.rappler.com/newsbreak/fact-check/video-family-swept-away-crising-flood-ai-generated/",
    "title": "FACT CHECK: Video of family swept away by Crising flood is AI-generated",
    "content": "Claim:A video shows a family caught in floods caused byTropical Storm Crising(Wipha), which brought heavy rain to parts of Luzon in the Philippines.\nWhy we fact-checked this:The video containing the claim has 377,300 views, 2,100 likes, 297 comments, and 502 shares as of writing.\nText in the video states: “Typhoon Crising,ang lupit mo(you’re so devastating). God, help us.”\nMany viewers appeared to believe the video was authentic, with numerous comments expressing sympathy for the family in the video.\nThe video was posted on July 19 as Severe Tropical Storm Crising brought heavy rain to Northern Luzon, later exiting the Philippine Area of Responsibility (PAR) that same day.\nThe facts:Analysis by the AI detection toolSight Engineindicates the video is highly likely to be AI-generated, showing an 88% probability of being a deepfake. Results also indicated an 88% probability of face manipulation and a 7% likelihood of the use of generative AI.\nA reverse image search of a screenshot from the video yields no reports from credible sources matching the incident depicted in the clip.\nTropical Storm Crising:Crisingdevelopedinto a tropical depression on July 16, laterintensifyingon July 19 into a severe tropical storm with maximum sustained winds of 100 km/h and gusts of 125 km/h. It exited the PAR later that morning.\nCrising amplified thesouthwest monsoon, bringing heavy rain and strong winds to Metro Manila, Central Luzon, and parts of Southern Luzon and Visayas. Even after leaving the PAR, Crising continued to affect the weather over much of Luzon and the Visayas.\nCrising is the Philippines’ third tropical cyclone for 2025 and the second in July, followingTyphoon Bising.\nWeather updates:As of July 25, the Philippine Atmospheric, Geophysical, and Astronomical Services Administration (PAGASA) is monitoringEmong (Co-may), which made its second landfall in Ilocos Sur on Friday morning, then weakened into a severe tropical storm.\nFor legitimate weather updates, visit PAGASA’sofficial website,X (formerly Twitter) page, andYouTube channel. Updates can also be found on Rappler’sPhilippine weather page.– Marjuice Destinado/Rappler.com\nMarjuice Destinado is a senior political science student at Cebu Normal University (CNU). AnAries Rufo Journalism Fellowof Rappler for 2025, she is also the feature editor ofAng Suga, CNU’s official student publication."
  },
  {
    "url": "https://www.rappler.com/newsbreak/fact-check/deepfake-sara-duterte-fake-investment-ad/",
    "title": "FACT CHECK: Deepfake video of Sara Duterte used in fake investment ad",
    "content": "Claim:Vice President Sara Duterte is promoting an investment plan that claims to pay out as much as P1 million per month following an initial payment of P15,000.\nWhy we fact-checked this:The claim can be found in a video on two Facebook posts on July 12; one is from the page “Mosco” with around 1,300 reactions, 303 comments, and 125 shares as of writing, and another is from the page “Verdie Purdy” with around 1,600 reactions, 308 comments, and 170 shares as of writing.\nThe video, with the caption “Sara Duterte’s post trial interview! She told the truth!” shows a likeness of Duterte speaking about the supposed investment plan. It also has the logo of the ABS-CBN showTV Patrolon the upper right portion.\nEach post has a link below the video that, when clicked, leads to an external website that was made to look like the officialAssociated Press (AP)website.\nThe facts:The video shown in the Facebook posts is a deepfake. Duterte is not endorsing any supposed investment plan.\nThe background of the video was from an interview that the Vice President conducted while in Melbourne, Australia, on June 22; an example of a legitimate video of the interview can be found on theABS-CBN News official YouTube channel.\nIn the interview, Duterte spoke about various topics, including her views on President Ferdinand Marcos Jr. and his administration, her ongoing impeachment, and the health condition and interim release possibilities of her father, former president Rodrigo Duterte, who is currently detained at the International Criminal Court (ICC). She did not mention any investment scheme.\nDubious site:The external website that masquerades as anAP websiteseems to be aphishing site, which steals personal information through deception. Its Uniform Resource Locator is not from the legitimateAP website. (READ:Phishing 101: How to spot and avoid phishing)\nUpdates on impeachment and ICC case:The Dutertes currently face a string of controversies. Sara Duterte is challenging herimpeachmentbefore the Supreme Court, with the High Courtaskingthe House of Representatives and the Senate for comments and additional information related to the impeachment. (READ:SUMMARY: What are details SC requires from Congress in VP Sara impeachment?)\nMeanwhile, the Duterte patriarch isseeking temporary freedom, with the ICC prosecution expressing itsstrong oppositionto his interim release to a country of his choosing. As of writing, there is no update yet on whether Duterte will be granted interim release.\nAhead of the former president’s confirmation of charges hearing on September 23, the prosecution has also recently disclosed evidence to the Duterte camp, which includesinformation about the witnessesagainst Duterte.\nPrevious related fact-checks:Rappler has published several fact-checks of deepfake videos aided byartificial intelligence (AI). A recent one, published on July 15, is of a deepfake video in which a likeness of Senator Bam Aquino can be seen promoting asimilar investment scam.\nHere are some of Rappler’s articles about deepfakes and the various ways to spot them:\n– Percival Bueser/Rappler.com\nPercival Bueser is a graduate of Rappler’s fact-checking mentorship program. This fact check was reviewed by a member of Rappler’s research team and a senior editor. Learn more about Rappler’s fact-checking mentorship programhere.\nKeep us aware of suspicious Facebook pages, groups, accounts, websites, articles, or photos in your network by contacting us at factcheck@rappler.com. Let us battle disinformation one Fact Check at a time."
  },
  {
    "url": "https://www.rappler.com/newsbreak/fact-check/no-lawsuit-filed-vs-bato-dela-rosa-missing-sabungero-case/",
    "title": "FACT CHECK: No complaint filed vs Dela Rosa over missing sabungeros case",
    "content": "Claim: Gambling tycoon Atong Ang filed a legal complaint against Senator Ronald “Bato” Dela Rosa after the senator linked Ang to the missingsabungeros(cockfighting enthusiasts) case.\nWhy we fact-checked this:The Facebook page “Magsasaka Mabuhay Ka,” boasting over 1.5 million followers, published the post. As of writing, the post has accumulated more than 225 reactions, 105 comments, and 19 shares.\nThe caption says: “A power move no one saw coming! Gambling tycoon Atong Ang has reportedly filed legal action against Senator Bato Dela Rosa — and the viral video exposing their explosive conflict is now circulating online. Is this retaliation… or something much deeper?”\nIn the thumbnail, it added:“Nagkalaglagan na! Bato arestado!”(Everyone’s turning on each other! Bato was arrested!)\nThe post also links to a supposed news article and an image depicting Dela Rosa in handcuffs being led away by police.\nThe post was made following recent revelations in thecase of the missingsabungeros.\nThe facts: No reports confirm any legal complaint filed against Dela Rosa by Ang. The senator is also not in the custody of any law enforcement body.\nOn the contrary, on July 9, Dela Rosa conducted apress conferencewhere he discussed various issues, including the impeachment trial of Vice President Sara Duterte, the ongoing investigation into the missingsabungeros, and efforts to bring home detained former president Rodrigo Duterte from The Hague.\nDuring the press conference, Dela Rosa said that Ang’s name was mentioned in theSenate hearing on thesabungeroscase in 2022, which he spearheaded as part of the Senate Committee on Public Order and Dangerous Drugs. Headded, however, that at the time, there was no evidence directly linking Ang to the case.\nLikely AI-generated photo:The image of Dela Rosa in handcuffs shows indicators of being AI-generated. A notable anomaly is the presence of a hand gripping his left arm, even though the police officer in the photo has his back turned.\nAccording to an article fromKellogg Insight, a research publication magazine, AI modelscommonly create bodieswith unusual, and at times fantastical, anatomical features. This is among the signs that users must be wary of when viewing or sharing suspicious AI-generated images online.\nThis finding is reinforced by WinstonAI, a content authentication tool, which assessed the image as having a40% probability of being AI-generated.\nBaseless claims:The article linked in the post alleges that a viral video exists wherein Ang, in a private meeting, issued threats against Bato. This supposed video is nowhere to be found in the post or the article.\nThe article also cited supposed quotes from both Dela Rosa and Ang. In one of the excerpts, it claimed that Dela Rosa spoke in a radio interview on July 7 about the legal case filed against him by Ang.\nUpon checking the senator’sactivities that day, however, there is no record of scheduled radio interviews that he attended.\nMoreover, the website hosting the supposed news article features suspicious content and thumbnail images. The logo of the alleged news site itself bears the words“USA News.”\nThe missing sabungeros:The search for the missingsabungeroshas been ongoing for several years. As of December 2022, families have reported 34 individuals missing. (READ:TIMELINE: What happened to missing sabungeros?)\nIn June, Julie Patidongan, also known as “Totoy,” claimed that thesabungeroswerestrangled to death and their bodies disposed of in Taal Lake. He added that nearly 100 cockfighting workers have been killed — far more than the 34 officially reported missing.\nPatidongan, who is also a suspect in the case, namedAngas the alleged mastermind behind the disappearances. He also implicated actress Gretchen Barretto. Both Ang and Barretto have denied the allegation. (READ:Atong Ang and his controversies that stretch across presidents)\nOn Thursday, July 10, authorities announced that the search forthe alleged remains of the victimsin Taal Lake hadbegun.–Jerry Yubal Jr./Rappler.com\nJerry Yubal Jr. is a graduate of Aries Rufo Journalism fellow of Rappler for 2023-2024. This fact check was reviewed by a member of Rappler’s research team and a senior editor. Learn more about Rappler’s fact-checking mentorship programhere.\nKeep us aware of suspicious Facebook pages, groups, accounts, websites, articles, or photos in your network by contacting us at factcheck@rappler.com. Let us battle disinformation oneFact Checkat a time."
  }
]